<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b8dacdf0103c3c6a3ac447ea46fb3f68c435db5e87bec1a21d98b55071bc9536","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #589 at https://github.com/cal-itp/data-infra/actions/runs/17622130518","plan_out_hash":"011dc42723a5f5512c429506214307090e12d2bfef307cf5a06f93851c595fab","plan_hash":"c65b2a820f7adf23a80b35be4db86f0559682d798940151591f202db6193e81f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9Bqr4w==" -> (known after apply)
!~      detect_md5hash      = "mInadWRDWjh+tokFz6gkng==" -> "different hash"
!~      generation          = 1757464206568623 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "mInadWRDWjh+tokFz6gkng==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "vxfhWw==" -> (known after apply)
!~      detect_md5hash      = "tIKyKSkVeHX6Hy5dMmfDkg==" -> "different hash"
!~      generation          = 1750272586525890 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/_src.yml"
!~      md5hash             = "tIKyKSkVeHX6Hy5dMmfDkg==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/_stg_ntd_ridership.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "adHsYA==" -> (known after apply)
!~      detect_md5hash      = "nQsVW2IKo7YMCC23uoeLMQ==" -> "different hash"
!~      generation          = 1749663116236709 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/_stg_ntd_ridership.yml"
!~      md5hash             = "nQsVW2IKo7YMCC23uoeLMQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/_stg_ntd_ridership.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "0a690w==" -> (known after apply)
!~      detect_md5hash      = "IUyhnmVFziGZDy/h4Z5Gzw==" -> "different hash"
!~      generation          = 1757464208416781 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "IUyhnmVFziGZDy/h4Z5Gzw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #589](https://github.com/cal-itp/data-infra/actions/runs/17622130518)